readme.org
*** Acordes para seleccion de texto
#+begin_src emacs-lisp 
  (mimacs-lider
    :states '(normal insert)
    "SPC" 'set-mark-command)
#+end_src

*** Acordes para completar:
#+begin_src emacs-lisp 
(general-define-key
  :states '(normal insert emacs)
  "C-M-i" 'completion-at-point)
#+end_src

*** Acordes de =embark= (globales)
#+begin_src emacs-lisp 
  (with-eval-after-load 'embark
    (general-define-key
     :states '(normal insert emacs visual)
     "M-o"  'embark-act
     "M-S-o" 'embark-dwim
     "C-h B" 'embark-bindings))
#+end_src

*** Acordes locales para =vertico=
#+begin_src emacs-lisp 
  (with-eval-after-load 'vertico
    (define-key vertico-map (kbd "C-j") 'vertico-next)
    (define-key vertico-map (kbd "C-k") 'vertico-previous)
    (define-key vertico-map (kbd "M-H") 'vertico-directory-up))
#+end_src

*** Acordes para =kmacro=
#+begin_src emacs-lisp 
  (with-eval-after-load 'consult
    (mimacs-lider
      :infix "k"
      "c" '(consult-kmacro :which-key "cargar macro")))

  (mimacs-lider
    :infix "k"
    "" '(:ignore t)
    "g" 'kmacro-start-macro
    "d" 'kmacro-end-macro
    "TAB" 'kmacro-insert-counter
    "e" 'kmacro-set-counter
    "s" 'kmacro-add-counter
    "k" 'kmacro-call-macro)
#+end_src

*** Provide
Finalmente, se define el /provide/ del módulo
#+begin_src emacs-lisp 
  (provide 'mimacs-acordes)
#+end_src

** mimacs-seleccion
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modulos/mimacs-seleccion.el
:END:
Este módulo se encarga de:
+ Configuración básica de ecosistema de selección usando =vertico=, =consult=, =marginalia=, =savehist=, =orderless=, y =embark=

[[https://github.com/minad/vertico][=vertico=]] es un paquete similar a =ivy= que permite la selección de opciones de forma amigable, estética, y sin tomar mucho espacio de pantalla como sí lo hace =helm=. Si bien es casi que equivalente en cuanto a funcionalidad a =ivy=, es preferible por se más ligero y aprovechar de mejor forma las funcionalidades nativas de emacs en lugar de crear funcionalidades adicionales como sí lo hace el ecosistema =ivy=. 

Al tener una mejor utilización de funcionalidades de emacs, la configuración de =vertico= es mucho más simple:

#+begin_src emacs-lisp 
  (use-package vertico
    :config
    ;; Activa la extension =vertico-directory=
    (add-to-list 'load-path
		 (expand-file-name "straight/build/vertico/extensions"
				   straight-base-dir))
    (require 'vertico-directory)
    (vertico-mode))
#+end_src

=savehist= es un paquete incluido en emacs que permite guardar información de sesiones. Para el caso de =vertico=, permite guardar las opciones seleccionadas para que aparezcan en orden de seleccionado (de la más reciente a la más antigua).

#+begin_src emacs-lisp 
  (use-package savehist
    :after vertico
    :config
    (savehist-mode))
#+end_src

=marginalia= es un paquete equivalente a =ivy-rich= que mejora la estética de las listas de selección de =vertico= agregándoles información adicional.
#+begin_src emacs-lisp 
  (use-package marginalia
    :after vertico
    :config
    (marginalia-mode))
#+end_src

Para tener íconos (de =all-the-icons=) en /buffers/ de selección, se debe usar el paquete =all-the-icons-completion=.
#+begin_src emacs-lisp 
  (use-package all-the-icons-completion
    :after marginalia
    :config
    (all-the-icons-completion-mode))
#+end_src

=orderless= permite definir distintos métodos para filtrar opciones en sistemas de selección como =vertico=. La siguiente configuración permite un /fuzzy find/ para cualquier lista de candidatos de =vertico=.
#+begin_src emacs-lisp 
  (use-package orderless
    :after vertico
    :config
    (setq completion-styles '(orderless basic)))
#+end_src

=consult= permite la creación de comandos específicos que permiten selección de opciones como resultado. Dentro de todas las funciones que ofrece, las que más uso son =consult-org-heading=, =consult-buffer=, y =consult-line=.

#+begin_src emacs-lisp 
  (use-package consult
    :after vertico)
#+end_src

=embark= es una especie de clic derecho para emacs. Es similar a las opciones mostradas en =ivy= con =M-o=, pero se puede usar para cualquier elemento: URLs en texto, opciones de mini buffer, selección de texto, cadenas de caracteres, expresiones lisp, funciones, etc. Es supremamente poderoso y flexible.

#+begin_src emacs-lisp 
   ;; Este paquete se encarga de integrar =embark=y =consult= . Debe ser cargado antes de cargar =embark=
   (use-package embark-consult
     :after consult
     :hook
     (embark-collect-mode . consult-preview-at-point-mode))

   (use-package embark
     :config
     ;; La siguiente configuración hace que =embark= muestre un menu de
     ;; ayuda con cualquier prefijo de acorde. Es como un =which-key= bajo
     ;; demanda que se activa con =C-h=. Por ejemplo, estando en =org-mode=,
     ;; si se hace =C-c= no pasa nada (teniendo =which-key= desactivado),
     ;; pero si se agrega =C-h= se muestra un menú completo de las funciones
     ;; disponibles luego de ese prefijo. También funciona con acordes de
     ;; =evil=
     (setq prefix-help-command #'embark-prefix-help-command))
#+end_src

Finalmente, se define el /provide/ del módulo
#+begin_src emacs-lisp 
  (provide 'mimacs-seleccion)
#+end_src

** mimacs-org-mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modulos/mimacs-org.el
:END:
Este módulo se encarga de configuración básica de =org-mode=. Otros paquetes que se basan en =org= pero que tengan casos de uso específicos (como =org-roam= o =org-ref=) se configuran en otros módulos. Se configura con =use-package= para que descargue la versión más reciente de =org= y no se quede con la que traiga la versión de =emacs= que estamos usando.

Al ser un módulo complejo, se escribe usando =noweb=.

#+begin_src emacs-lisp :noweb no-export
  (use-package org
    :custom
    <<org-custom>>
    :hook
    <<org-hook>>
    :config
    <<org-config>>
  
  (provide 'mimacs-org)
#+end_src

*** Configuraciones visuales básicas
#+begin_src emacs-lisp :noweb no-ref org-custom :tangle no
  (org-startup-folded t)           ; Colapsar contenido al abrir un archivo
  (org-startup-align-all-table t)  ; Empezar con las tablas colapsadas
  (org-startup-indented t)         ; Activar org-indent-mode por defecto 
  (org-tags-column 0)              ; Quitar espacio entre título y etiquetas
  (org-list-allow-alphabetical t)  ; Permitir listas con letras
  (org-table-header-line-p t)      ; Congelar primera fila de tablas largas
  (org-confirm-babel-evaluate nil) ; No pedir confirmación para ejecutar código desde babel
#+end_src

*** Desactivar =electric-indent-mode= en =org=
#+begin_src emacs-lisp :noweb no-ref org-hook :tangle no
  (org-mode . (lambda () (electric-indent-local-mode -1)))
#+end_src

*** Seguir enlaces en la misma ventana
#+begin_src emacs-lisp :noweb no-ref org-custom :tangle no
  (setf (alist-get 'file org-link-frame-setup) #'find-file))
#+end_src
