modulos/mimacs-acordes.el
  "SPC" 'set-mark-command)

(general-define-key
  :states '(normal insert emacs)
  "C-M-i" 'completion-at-point)

(with-eval-after-load 'embark
  (general-define-key
   :states '(normal insert emacs visual)
   "M-o"  'embark-act
   "M-S-o" 'embark-dwim
   "C-h B" 'embark-bindings))

(with-eval-after-load 'vertico
  (define-key vertico-map (kbd "C-j") 'vertico-next)
  (define-key vertico-map (kbd "C-k") 'vertico-previous)
  (define-key vertico-map (kbd "M-H") 'vertico-directory-up))

(with-eval-after-load 'consult
  (mimacs-lider
    :infix "k"
    "c" '(consult-kmacro :which-key "cargar macro")))

(mimacs-lider
  :infix "k"
  "" '(:ignore t)
  "g" 'kmacro-start-macro
  "d" 'kmacro-end-macro
  "TAB" 'kmacro-insert-counter
  "e" 'kmacro-set-counter
  "s" 'kmacro-add-counter
  "k" 'kmacro-call-macro)

(provide 'mimacs-acordes)
